<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>AddAndRemoveFiles</title></head>
<body style="height: 226px;"><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<br><small><small>WorkSpace Manager&nbsp;<br>
&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0</small></small><h2><big>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&nbsp;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</big></h2>&#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1086;&#1074; <span style="font-weight: bold;">Add File(s)</span> &#1080; <span style="font-weight: bold;">Manipulate Entity</span>.<br><img style="width: 241px; height: 99px;" alt="" src="PicturesEn/Add_Delete_Move_Check_File.png"><br><br><h3>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;</h3>&#1060;&#1072;&#1081;&#1083;&#1099; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.<br>&#1044;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;:<br><ul><li>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1094;&#1077;&#1083;&#1077;&#1074;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;, &#1090;&#1086; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1088;&#1077;&#1085;&#1100; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;.</li><li>&#1042; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&nbsp;<span style="font-weight: bold;">File Editing</span> &#1074;&#1099;&#1079;&#1086;&#1074;&#1080;&#1090;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; <span style="font-weight: bold;">Add File</span>.</li><li>&nbsp;&#1042; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1077; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102; &#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;.</li></ul><small>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; <img style="width: 470px; height: 307px;" alt="" src="PicturesEn/ChooseFile.PNG"></small><ul><li>&#1047;&#1072;&#1082;&#1088;&#1086;&#1081;&#1090;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">Open</span> &#1080;&#1083;&#1080; &#1086;&#1090;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;.</li><li>&#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1073;&#1099;&#1083; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;, &#1090;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.</li></ul><h3>&#1043;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h3>&#1043;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1079; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; <span style="font-weight: bold;">Add&nbsp; From Folde</span>r.<br>&#1055;&#1088;&#1080;
&#1101;&#1090;&#1086;&#1084; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1048;&#1079; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1074;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
&#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; (WorkSpace). &#1042;&#1080;&#1076;&#1085;&#1099; &#1078;&#1077;
&#1073;&#1091;&#1076;&#1091;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;.<h3>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;</h3>&#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;<big>:<br></big><ul><li>&#1054;&#1090;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; &#1080; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">Delete File</span>.</li><li>&#1055;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1076;&#1080;&#1090;&#1077; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1072; &#1085;&#1077; &#1087;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077;.</li></ul><small><big>&#1042;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1077;&#1081; <span style="font-weight: bold;">Delete</span> &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;.<br>&#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1073;&#1086; &#1080;&#1082;&#1086;&#1085;&#1082;&#1091; <span style="font-weight: bold;">Delete File</span>, &#1083;&#1080;&#1073;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">Delete</span> &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;.<br><br><span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</span>: &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1079; &#1087;&#1072;&#1087;&#1082;&#1080; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; (&#1074; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;), &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1074;&#1086;&#1080;&#1084; (&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;) &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;.<br></big></small><h3><small><big>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</big></small></h3>&#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1085;&#1086; &#1077;&#1075;&#1086; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; WSM &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;:<br><ul><li>&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;</li><li>&#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072;&#1076; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;</li><li>&#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080;&#1082;&#1086;&#1085;&#1082;&#1080; Check Files</li></ul>&#1042; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;: &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1091;&#1079;&#1083;&#1091; (&#1080; &#1074;&#1089;&#1077;&#1084; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1091;&#1079;&#1083;&#1072;&#1084;).<br>&#1058;&#1077;&#1082;&#1091;&#1097;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; WSM &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1086;.<br><h3></h3><small><big><br></big><br><br></small><br>
<h2></h2><br></body></html>