<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>CreateAndEdit</title></head>
<body><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<br><small><small>WorkSpace Manager&nbsp;<br>
&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0</small></small><h2>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;</h2><p>&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1091;&#1102;, &#1090;&#1072;&#1082; &#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102;&nbsp; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1102;
&#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;. </p><p>&#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1072;
&#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1086;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;&nbsp;<span style="font-weight: bold;">Visual Prolog</span>. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; <span style="font-weight: bold;">&#1048;&#1084;&#1103;</span>
&#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1072; &#1082; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; (&#1080;&#1084;&#1103; &#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089; &#1085;&#1080;&#1084; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;) &#1080; &#1101;&#1090;&#1086; &#1080;&#1084;&#1103;&nbsp; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1077;&#1092;&#1080;&#1082;&#1089;&#1072; &#1074;
&#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; <span style="font-weight: bold;">$(&#1048;&#1084;&#1103;)</span>. &#1058;&#1072;&#1082;&#1072;&#1103; &#1087;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1076;&#1077;&#1089;&#1100; <span style="font-weight: bold;">WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;</span>.</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1054;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103;
&#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1089; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;
&#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;, &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1074; &#1083;&#1080;&#1096;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;.</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;.</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&nbsp;WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;.</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;"><img style="width: 695px; height: 528px;" alt="" src="PicturesEn/wsm_VariablesDemo.PNG"></p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;&nbsp;&#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077;&nbsp;<span style="font-weight: bold;">WSM-Variables</span> &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;&nbsp;<span style="font-weight: bold;">WorkSpace Settings</span> &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Options</span> &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.</p>&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1081;&nbsp;WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;<ul><li>&#1042;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; <span style="font-weight: bold;">WorkSpace Settings</span> &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">Options</span></li><li>&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091;&nbsp;<span style="font-weight: bold;">WSM-Variables</span></li><li>&#1053;&#1072;&#1078;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">New</span></li></ul>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &#1055;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;&nbsp;WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;&nbsp;&nbsp;<br>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; <img style="width: 653px; height: 125px;" alt="" src="PicturesEn/DefineVirtualDir.PNG"><br>&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp; &#1055;&#1086;&#1083;&#1077; <span style="font-weight: bold;">Name</span> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;&#1086;&#1084;, &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">Directory</span> - &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1073;&#1086; &#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Browse</span>.<ul><li>&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102; &#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;.</li></ul>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;&nbsp;&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Edit </span>(&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086; &#1078;&#1077; &#1086;&#1082;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;&nbsp;WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;) &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1086; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Delete</span>.<br><span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</span> &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; <span style="font-weight: bold;">.vipprj</span>&nbsp; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; <span style="font-weight: bold;">VipDir</span> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1089;&#1090;&#1086; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080; <span style="font-weight: bold;">Visual Prolog</span>.<br><h3>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;</h3>&#1042;
&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1086;&#1076;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090; &#1086;&#1076;&#1085;&#1080; &#1080; &#1090;&#1077; &#1078;&#1077; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1085;&#1086;
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1084; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1084;&#1077;&#1089;&#1090;&#1072;&#1093;
&#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.<br>&#1042; &#1090;&#1072;&#1082;&#1080;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; WSF-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; <span style="font-weight: bold;">.vars</span>.<br>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <span style="font-weight: bold;">SpbRSolutions/SpbVipTools/UserWS/vipXX.vars</span>.<br>&#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">WS Variable File</span> &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <span style="font-weight: bold;">.../Browse</span>.<br>&#1044;&#1083;&#1103; &#1086;&#1090;&#1084;&#1077;&#1085;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1095;&#1080;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">WS Variable File</span> &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">.../Clear</span>.<br><p><span style="font-weight: bold;">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;:</span> &#1042; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; Visual Prolog, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 9005 &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;&nbsp;<span style="font-weight: bold;">ide.vars</span> &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102; <span style="font-weight: bold;">[Visual Prolog]\appData</span> &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; IDE-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072;&#1094;&#1080;&#1102; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager</span> &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081; <span style="font-weight: bold;">Visual Prolog</span></p><h4>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;</h4>&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;&nbsp;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;:<br><ul><li>&#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1083;&#1077;&nbsp;<span style="font-weight: bold;">WS Variable File </span>&#1087;&#1091;&#1089;&#1090;&#1086;;</li><li>&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;c&#1086;&#1082; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1102;;</li><li>&#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">.../</span><span style="font-weight: bold;">Browse</span> &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1077;&#1075;&#1086; &#1080;&#1084;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1080;&#1090;&#1100; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072;.</li></ul><h4>&#1050;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;</h4>&#1044;&#1083;&#1103; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; WSM-&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;:<br><ul><li>&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">.../</span><span style="font-weight: bold;">Browse;</span></li><li>&#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;;</li><li>&#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">.../</span><span style="font-weight: bold;">Browse</span> &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1090;&#1086;&#1090; &#1078;&#1077; &#1092;&#1072;&#1081;&#1083;.</li></ul><br></body></html>