<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>FileTypeDef</title></head>
<body><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<br><small><small>WorkSpace Manager&nbsp;<br>
&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0</small></small><h2>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1085;&#1072;&#1076; &#1085;&#1080;&#1084;&#1080;</h2>&#1053;&#1072;&#1073;&#1086;&#1088; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1074;&#1072;&#1078;&#1085;&#1077;&#1081;&#1096;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1089; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;.<br>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1074;&#1086; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1077; <span style="font-weight: bold;">File Type</span> , &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Options</span> <br><br><img style="width: 228px; height: 94px;" alt="" src="PicturesEn/OptionsButton.PNG"><br>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">Options</span>, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1089;&#1077;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;.<br><br><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/FileOptions.PNG"><br><br>&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1087;&#1091;&#1090;&#1077;&#1084; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1099; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">Local Options</span>.
&#1069;&#1090;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1086;&#1073;&#1097;&#1080;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;. &#1051;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1076;&#1077;&#1089;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.<br><br><img style="width: 520px; height: 515px;" alt="" src="PicturesEn/LocalOptionsForm.PNG"><br><br><p>&#1053;&#1072;
&#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1085;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1091;&#1078;&#1077; &#1074; &#1085;&#1077;&#1084;
&#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099;. </p>&#1044;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;:<br><ul><li>&#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">Add.</span></li><li>&#1074;&nbsp;&#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1086;&#1082;&#1085;&#1077; &#1085;&#1072;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1042;&#1072;&#1084; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;, &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1077;&#1084;&#1091; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <span style="font-weight: bold;">xls.</span></li></ul>&#1045;&#1089;&#1083;&#1080;
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1090;&#1086;
&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;, &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102; &#1080;&#1083;&#1080; &#1090;&#1086;&#1095;&#1082;&#1091; &#1089;
&#1079;&#1072;&#1087;&#1103;&#1090;&#1086;&#1081;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; (&#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;).<br><br><img style="width: 555px; height: 123px;" alt="" src="PicturesEn/DefineExtesion.PNG"><br><br>&#1044;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;.<br><br><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/DefineExtesionXLS.PNG"><br><br>&#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; <span style="font-weight: bold;">&#1086;&#1090; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;</span> &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;, &#1085;&#1086;&#1084;&#1077;&#1088;&#1072;&nbsp;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1074; &#1074;&#1099;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1086;&#1083;&#1103;<br> <span style="font-weight: bold;">Op # [Index</span>].<br>&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; 1 &#1080; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <span style="font-weight: bold;">Open</span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086; &#1074; &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">Name</span>.<br>&#1042;&#1089;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1099; &#1080; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.<br>&#1045;&#1089;&#1083;&#1080;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1091;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1099;, &#1090;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">ReOrder</span> &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1089;&#1103;&#1082;&#1086;&#1081;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; (&#1087;&#1086;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080;).&nbsp; <br>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &nbsp;&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1102; &#1084;&#1077;&#1089;&#1090;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;.<br>&#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; <span style="font-weight: bold;">Windows</span> &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1072;&#1094;&#1080;&#1080;, &#1090;&#1086; &nbsp;&#1092;&#1083;&#1072;&#1075; <span style="font-weight: bold;">Invoke with Windows Association</span> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085; (&#1095;&#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;).<br>&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1090;&#1088;&#1080; &#1092;&#1083;&#1072;&#1075;&#1072; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;:<br><ul><li><span style="font-weight: bold;">Default Command (Mouse Double Click)</span> - &nbsp;&#1077;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1075; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &nbsp;&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1087;&#1086;&#1083;&#1077; [<span style="font-weight: bold;">Index</span>], &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1072; &#1087;&#1088;&#1080; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; (&#1080;&#1083;&#1080; <span style="font-weight: bold;">Enter</span>)
&#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1077; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;. &#1058;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1080;&#1079; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1075; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;. &#1055;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086;
&#1092;&#1083;&#1072;&#1075;&#1072; &#1076;&#1083;&#1103; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1080; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;
&#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;.</li><li><span style="font-weight: bold;">Partcipate in All</span> - &#1077;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1075; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1087;&#1086;&#1083;&#1077; [<span style="font-weight: bold;">Index</span>]
&#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1072;&#1103;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; &#1101;&#1090;&#1080;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1076;&#1083;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;. &#1048;&#1085;&#1072;&#1095;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1072;.</li><li><span style="font-weight: bold;">Check Status - &nbsp;</span>&#1077;&#1089;&#1083;&#1080;
&#1101;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1075; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1086;&#1074;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086;&#1084; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1072;&#1076; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1090;&#1080;&#1087;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1072; (&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; <span style="font-weight: bold;">Done</span>), &#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1050;&#1072;&#1082;&#1072;&#1103; &#1080;&#1079; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1072; &#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;&nbsp;<span style="font-weight: bold;">Done</span> &#1085;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.</li></ul>&#1045;&#1089;&#1083;&#1080; &#1092;&#1083;&#1072;&#1075;  <span style="font-weight: bold;">Invoke with Windows Association</span> &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, &#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1092;&#1086;&#1088;&#1084;&#1077;. <br><br>&#1060;&#1083;&#1072;&#1075;&nbsp;<span style="font-weight: bold;">Perform at Frontend Side</span> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1089;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1077; <span style="font-weight: bold;">BackEnd</span>. &#1044;&#1083;&#1103; &#1052;&#1086;&#1085;&#1086;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1074; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080;, &#1072; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; <span style="font-weight: bold;">FrontEnd</span> &#1080; <span style="font-weight: bold;">BackEnd</span> &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1072;&#1093;, &#1090;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; (&#1085;&#1072; &#1076;&#1072;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;).<br><br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1086;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">Format Command</span>. <br>&#1050;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1086;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1079; &#1074;&#1099;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1087;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; <span style="font-weight: bold;">"&lt;&lt;"</span>.<br>&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;:<br><ul><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Browse...</span> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;;</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">[Application]</span> - &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Application</span> (&#1087;&#1086;&#1083;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Format Command</span>);</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">[Argument]</span> - &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Arguments</span> (&#1087;&#1086;&#1083;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Application</span>);</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">[Suffix]</span> - &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Suffix</span> (&#1087;&#1086;&#1083;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1083;&#1103; <span style="font-weight: bold;">Arguments</span>);</li><li><span style="font-weight: bold;">&nbsp;&nbsp;&nbsp; $(SourceFile) -</span>
&nbsp;&#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;
&#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; (&#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1077;&#1089;&#1083;&#1080; &#1084;&#1072;&#1088;&#1096;&#1088;&#1091;&#1090; &#1082; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;
&#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; $(SourceFile) &#1074; &#1082;&#1072;&#1074;&#1099;&#1095;&#1082;&#1080;);</li><li><span style="font-weight: bold;">&nbsp;&nbsp;&nbsp; $(SourceName) -</span> &nbsp;&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;;</li><li><span style="font-weight: bold;">&nbsp;&nbsp;&nbsp; $(ExeName) -</span> &nbsp;&#1080;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;;</li><li><span style="font-weight: bold;">&nbsp;&nbsp;&nbsp; $(SourceExeDir) - </span>&nbsp;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;.</li></ul>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1087;&#1086;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1103;.<br><br>&#1055;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;
"&#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;" &#1080; "&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;" -
&nbsp;&#1089;&#1091;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1091; &#1092;&#1072;&#1081;&#1083;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.
&#1058;&#1072;&#1082;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1084;&#1091; &#1092;&#1072;&#1081;&#1083;&#1091; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; <span style="font-weight: bold;">.vipprj</span> &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; <span style="font-weight: bold;">&nbsp;Visual Prolog</span>, &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; - &#1101;&#1090;&#1086; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1086;&#1088;&#1086;&#1078;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1072;&#1084;&#1080;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1086;&#1084; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <span style="font-weight: bold;">WorkSpaceManager</span> &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; "&#1079;&#1085;&#1072;&#1077;&#1090;" &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1080; &#1075;&#1076;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;&nbsp;&#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;. &#1053;&#1086; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1079; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager</span>
&#1090;&#1072;&#1082;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1072;. &#1059; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; "&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086;" &#1092;&#1072;&#1081;&#1083;&#1072;,
&#1087;&#1088;&#1080; &#1077;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077;, &#1084;&#1077;&#1089;&#1090;&#1086; &#1080; &#1080;&#1084;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086; &#1089;&#1074;&#1086;&#1080;&#1084; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1072;&#1084;.<br><br>&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; <span style="font-weight: bold;">WorkSpaceManager</span>
&#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1072; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; "&#1079;&#1085;&#1072;&#1077;&#1090;", &#1082;&#1072;&#1082;
&#1087;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1077;&#1089;&#1090;&#1086; &#1080; &#1080;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086;
&#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1077;, &#1080;&#1084;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">File Type&nbsp;Expert</span>, &#1080; &#1101;&#1090;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1089;&#1082;&#1086;&#1084;&#1099;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1080; &#1080;&#1084;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.<br><br>&#1042; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&nbsp;<span style="font-weight: bold;">WorkSpaceManager</span> &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &nbsp;&#1076;&#1083;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;<span style="font-weight: bold;"> Visual Prolog</span> &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1072;. &#1040; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1072; &#1080; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072; &#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102; <span style="font-weight: bold;">WorkSpaceManager</span>.<br><br>&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; <span style="font-weight: bold;">WorkSpaceManager</span>
&#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
&#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1101;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1084;
&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, .exe, .cmd).<br><br>&#1042;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &nbsp;&#1092;&#1083;&#1072;&#1075;&nbsp;<span style="font-weight: bold;">Handle Stream</span> &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;:<br><ul><li><span style="font-weight: bold;">&nbsp; &nbsp; &nbsp;KeyWords</span>
- c&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074;&nbsp;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1083;&#1091;&#1078;&#1072;&#1090; &#1076;&#1083;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1080;&#1083;&#1080; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1086; &#1080;&#1093; &#1087;&#1086;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1102; &#1074; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;.</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Coding</span> - &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1072;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1089;&#1080;&#1084;&#1086;&#1074;&#1086;&#1083;&#1086;&#1074; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;.</li></ul>&#1044;&#1083;&#1103; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;:<br>&nbsp;&nbsp;&nbsp; &#1055;&#1086;&#1083;&#1085;&#1086;&#1077; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; (&#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">Browse</span>), &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1074;&#1086; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; ( &#1087;&#1086;&#1083;&#1077; <span style="font-weight: bold;">Coding</span>).<br><br>&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1080; &#1076;&#1083;&#1103; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;&nbsp;<span style="font-weight: bold;"> Visual Prolog</span>:<br><ul><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Edit</span> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1072; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <span style="font-weight: bold;">Visual Prolog (Vip.exe)</span>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1076;&#1072;&#1083;&#1077;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; <span style="font-weight: bold;">WorkSpaceManager</span>;</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Build</span> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; <span style="font-weight: bold;">VipBuilder.exe</span>,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1090;
&#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103;;</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">Rebuild</span> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1089;&#1083;&#1077;&#1076;&#1099; &#1087;&#1088;&#1077;&#1076;&#1091;&#1097;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1094;&#1080;&#1081; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;;</li><li>&nbsp;&nbsp;&nbsp; <span style="font-weight: bold;">RunExe - &nbsp;</span>&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1077; &#1082;&#1072;&#1082; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; <span style="font-weight: bold;">Build</span> &#1080;&#1083;&#1080; <span style="font-weight: bold;">&nbsp;Rebuild</span>.</li></ul><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/VipEdit.PNG"><br><br><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/VipBuild.PNG"><br><br><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/VipReBuild.PNG"><br><br><img style="width: 695px; height: 601px;" alt="" src="PicturesEn/VipRunExe.PNG"></body></html>