<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>FileActions</title></head>
<body><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<br><small><small>WorkSpace Manager&nbsp;</small></small><br><small><small>
&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0</small></small><small><small><span style="font-weight: bold;"></span></small></small><br><small><small><span style="font-weight: bold;"></span></small></small><h2 style="font-family: Arial;">&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;&nbsp; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h2>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1082;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &nbsp;&#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <span style="font-weight: bold;">Options</span>:<br><ul style="font-family: Arial;"><li>&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;;</li><li>&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081;;</li><li>&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1082; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;, &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1081;;</li><li>&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1086;&#1082; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.</li></ul><span style="font-family: Arial;">&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1072; </span><span style="font-weight: bold; font-family: Arial;">File Actions</span><span style="font-family: Arial;">.</span><br style="font-family: Arial;"><span style="font-family: Arial;">&#1063;&#1077;&#1090;&#1099;&#1088;&#1077;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;, &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;,
&#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1080; &#1086;&#1076;&#1080;&#1085; &#1092;&#1072;&#1081;&#1083; &#1085;&#1077;
&#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; -
&#1085;&#1086;&#1084;&#1077;&#1088;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;.</span><br style="font-family: Arial;"><span style="font-family: Arial;">&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072;&#1093; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &nbsp;&#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1080;&#1087;&#1072; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.</span><br style="font-family: Arial;"><small><small><big><br></big></small></small><table style="text-align: left; width: 493px; height: 406px;" border="1" cellpadding="2" cellspacing="2"><tbody><tr><td>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; &nbsp;VIRPRJ</td><td><small><small><big><img style="width: 361px; height: 179px;" alt="" src="PicturesEn/MarkedVPIPRJ.PNG"><br></big></small></small></td></tr><tr><td>&#1042;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; &nbsp;HTML</td><td><small><small><img style="width: 357px; height: 194px;" alt="" src="PicturesEn/MarkedHTML.PNG"><br></small></small></td></tr></tbody></table><small><small><big><br></big></small></small>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1074;&#1072; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072;: <br><ul><li>&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1076; &#1086;&#1076;&#1080;&#1084; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; (&#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080;) &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;</li><li>&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093;, &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1093; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</li></ul>&#1050;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1074;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;:<br><ul><li>&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;(&#1080;) &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; (&#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;) - &#1073;&#1077;&#1075;&#1091;&#1097;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1072;.</li><li>&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1074;&#1089;&#1077;&#1084;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; - &#1076;&#1074;&#1077; &#1073;&#1077;&#1075;&#1091;&#1097;&#1080;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1099; &#1080; &#1087;&#1088;&#1080;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1077; <span style="font-weight: bold;">All</span>, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; <span style="font-weight: bold;">Build All</span> &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; VIPPRJ &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; &#1074;&#1099;&#1096;&#1077;.</li></ul>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1103;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085;&#1072;.<br>&#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1090;&#1086; &#1086;&#1085;&#1072; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;.<br>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &nbsp;&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &nbsp;&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; (&#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; <span style="font-weight: bold;">State</span> &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;), &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;-&#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; (&#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; <span style="font-weight: bold;">Err/Warn</span>),&nbsp; &#1076;&#1072;&#1090;&#1099; &#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; (&#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; <span style="font-weight: bold;">Date,Time</span>)&nbsp;<br>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;&#1084;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;:<br><ul><li>Done - &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;;</li><li>Failed - &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;;</li><li>Not Found - &#1092;&#1072;&#1081;&#1083; &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;.</li></ul>&#1055;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; WorkSpaceManager &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1082;&#1088;&#1080;&#1090;&#1077;&#1088;&#1080;&#1077;&#1074; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1083;&#1080; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1089;&#1090;&#1080; (<span style="font-weight: bold;">Done</span> &#1080; <span style="font-weight: bold;">Failed</span>)
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;. &#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1101;&#1090;&#1086;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; plug-in - &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1090;&#1077; &#1090;&#1080;&#1087;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;.<br><br>&#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1074;&#1089;&#1077;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1080;&#1083;&#1080; &#1085;&#1072;&#1076; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;,
&#1077;&#1089;&#1083;&#1080; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;&#1093; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;
&#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
&#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; <span style="font-weight: bold;">Done</span>. &nbsp;&#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1077;&#1097;&#1077; &#1085;&#1077; &#1073;&#1099;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099; &#1080;&#1083;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1089; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1084;&#1080;.<br>&#1053;&#1086;
&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080;&#1083;&#1080;
&#1074;&#1089;&#1077;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; (&#1089;&#1073;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100;) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <span style="font-weight: bold;">Reset</span> <span style="font-weight: bold;">Selected</span> &#1080;&#1083;&#1080; <span style="font-weight: bold;">Reset All</span>.<br><span style="font-weight: bold;">Reset</span> <span style="font-weight: bold;">Selected</span> &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084; (&#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;) &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;.<br><span style="font-weight: bold;">Reset All</span> &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086; &#1074;&#1089;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;.<br>&#1055;&#1077;&#1088;&#1074;&#1086;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1083;&#1102;&#1073;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1086;&#1090; <span style="font-weight: bold;">&nbsp;Done</span>, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1077; -&nbsp; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; <span style="font-weight: bold;">Done</span>. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1091;&#1076;&#1072;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080; &#1076;&#1072;&#1090;&#1099;-&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.<br><br>&#1042;
&#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1097;&#1077;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;
&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1095;&#1080;&#1089;&#1083;&#1072; &#1087;&#1086;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1077;, &#1072; &#1074; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1093; - <br>&nbsp;&nbsp;&nbsp; D - &#1095;&#1080;&#1089;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093;;<br>&nbsp;&nbsp;&nbsp; F - &nbsp;&#1095;&#1080;&#1089;&#1083;&#1086; &#1085;&#1077;&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093;;<br>&nbsp;&nbsp;&nbsp; NF - &#1095;&#1080;&#1089;&#1083;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1085;&#1077; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093;.<br><br>&#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1085;&#1072;&#1076; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1072; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1089; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1087;&#1091;&#1089;&#1082;&#1086;&#1084; (<span style="font-weight: bold;">Pause/Run</span>) &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1085;&#1072;&#1103; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; (<span style="font-weight: bold;">Stop</span>).
&#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1077;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;
&#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; (&#1080;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;) &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;
&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.<br><br><br><br><br><br></body></html>