<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html><head><meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"><title>WorkSpaceStructure</title></head>
<body><small><small>Copyright (c) Prolog Developemnt Center SPb</small></small>
<br><small><small>WorkSpace Manager&nbsp;<br>
&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; 2.0</small></small><br><h2><span style="font-weight: bold;"></span><a name="FilesStructuring"></a>&#1057;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h2><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1044;&#1077;&#1088;&#1077;&#1074;&#1086;
&#1074; &#1083;&#1077;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1099;&nbsp; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1086;
&#1089;&#1074;&#1086;&#1077;&#1084; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;. &#1055;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1076;&#1080;&#1085;
&#1091;&#1079;&#1077;&#1083; - &#1082;&#1086;&#1088;&#1077;&#1085;&#1100;, &#1080; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; (&#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1077;&#1089;&#1090;&#1100;) &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090;
&#1101;&#1090;&#1086;&#1084;&#1091; &#1091;&#1079;&#1083;&#1091;. &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1076;&#1088;&#1077;&#1074;&#1086;&#1074;&#1080;&#1076;&#1085;&#1091;&#1102;
&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;<br></p><font style="font-family: Arial;"><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"></span><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;">&#1055;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1076;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072; &#1091;&#1079;&#1083;&#1086;&#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; -<span>&nbsp;</span><span style="font-weight: bold;">&#1075;&#1088;&#1091;&#1087;&#1087;&#1072; (Group)</span><span> </span>&#1080;<span>&nbsp;</span><span style="font-weight: bold;">&#1087;&#1072;&#1087;&#1082;&#1072; (Folder)</span>.</span><br style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span style="font-weight: bold;">&#1043;&#1088;&#1091;&#1087;&#1087;&#1072;</span><span>&nbsp;</span>&#1084;&#1086;&#1078;&#1077;&#1090;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080; &#1077;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
&#1042; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1080;&#1093;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103;.</span><br style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span style="font-weight: bold;">&#1055;&#1072;&#1087;&#1082;&#1072;</span><span>&nbsp;</span>&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;&nbsp;&#1092;&#1072;&#1081;&#1083;&#1099;, &#1090;&#1080;&#1087;&#1099;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1074; WSM, &#1080; &nbsp; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1074; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080; &#1074;
&#1077;&#1077; &#1087;&#1086;&#1076;&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1103;&#1093;.</span><br style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;">&#1055;&#1072;&#1087;&#1082;&#1072;
&#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;.&nbsp;&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099;
&#1087;&#1072;&#1087;&#1082;&#1080; &#1080; (&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;) &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;&nbsp;&#1080;&#1093;. &#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084;&#1080; &#1080;
&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1083;&#1080;&#1096;&#1100; &#1103;&#1088;&#1082;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;
&#1092;&#1072;&#1081;&#1083; &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;.</span><br style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"></font><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1054;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1093; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1083;&#1080; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091;. &#1051;&#1102;&#1073;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1077;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074;
&#1083;&#1102;&#1073;&#1086;&#1081; &#1091;&#1079;&#1077;&#1083; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.<br><span style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px;"><br></span>&#1042;
&#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1092;&#1086;&#1088;&#1084;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1083;&#1077;&#1074;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;,
&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087; &#1080; &#1087;&#1072;&#1087;&#1086;&#1082;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1076; &#1074;&#1089;&#1077;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;, &#1083;&#1080;&#1073;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1076;
&#1095;&#1072;&#1089;&#1090;&#1100;&#1102;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;.</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1053;&#1072;&#1076;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&nbsp; &#1080; &#1085;&#1072;&#1076; &#1076;&#1077;&#1088;&#1077;&#1074;&#1086;&#1084; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;
Drag-And-Drop, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1099; &#1080;
&#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;.&nbsp;</p><p style="color: rgb(0, 0, 0); font-size: medium; font-style: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 2; word-spacing: 0px; font-family: Arial;">&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; Ctrl-Up, Ctrl-Down.</p><h4 style="font-family: Arial;"><a name="AddNode"></a>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087; &#1080; &#1087;&#1072;&#1087;&#1086;&#1082;</h4><font style="font-family: Arial;">&#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;&#1080; (&#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1092;&#1086;&#1082;&#1091;&#1089;):<br></font><ul style="font-family: Arial;"><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&nbsp; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; (<span style="font-weight: bold;">Add Group</span>)</li><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1087;&#1087;&#1091; (<span style="font-weight: bold;">Add SubGroup</span>)</li><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1087;&#1082;&#1091; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; (<span style="font-weight: bold;">Add Folder</span>)</li><li>&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1087;&#1082;&#1091; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;&nbsp;(<span style="font-weight: bold;">Add SubFolder</span>)</li></ul><font style="font-family: Arial;">&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1083;&#1080;&#1073;&#1086; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1083;&#1080;&#1073;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;.<br>&#1044;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;.<br>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;.<br>&#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;.<br></font><p><font style="font-family: Arial;">&#1055;&#1088;&#1080;
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;, &#1075;&#1076;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;
&#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102;. &#1055;&#1088;&#1080; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1084; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1101;&#1090;&#1086;&#1081; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;
&nbsp;&#1080; &#1074;&#1089;&#1077;&#1093; &#1085;&#1080;&#1078;&#1077;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1081;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;
&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.</font></p><h4 style="font-family: Arial;"><a name="RemoveNode"></a>&#1059;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087; &#1080; &#1087;&#1072;&#1087;&#1086;&#1082;</h4><font style="font-family: Arial;">&#1059;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1072; &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;.<br>&#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; <span style="font-weight: bold;">Manipulate Entity </span>&#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1091;&#1079;&#1083;&#1072; - <span style="font-weight: bold;">Delete Node</span>.<br>&#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1091;&#1079;&#1083;&#1072; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;:<br></font><ul style="font-family: Arial;"><li>&#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1091;&#1079;&#1083;&#1072;, </li><li>&#1083;&#1080;&#1073;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1091;&#1085;&#1082;&#1090; <span style="font-weight: bold;">Delete Node</span>, &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1084;&#1099;&#1096;&#1080; &#1084;&#1077;&#1085;&#1102; </li><li>&#1083;&#1080;&#1073;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <span style="font-weight: bold;">Delete</span> &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;</li></ul><font style="font-family: Arial;"><span style="font-weight: bold;"></span>&#1055;&#1088;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;.<br>&#1055;&#1088;&#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1077;, &#1091;&#1076;&#1072;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1080;&#1079; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.<br></font><h4 style="font-family: Arial;"><span style="font-weight: bold;"></span><a name="RenameNode"></a>&#1055;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1080;</h4><font style="font-family: Arial;">&#1051;&#1102;&#1073;&#1086;&#1072;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1072;.<br>&#1044;&#1083;&#1103;
&#1087;&#1077;&#1088;&#1077;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1091;&#1079;&#1083;&#1072; (&#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1080;&#1083;&#1080; &#1087;&#1072;&#1087;&#1082;&#1072;) &#1074; &#1076;&#1077;&#1088;&#1077;&#1074;&#1077; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086;&nbsp;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079; &#1082;&#1083;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100; &#1085;&#1072; &#1080;&#1084;&#1077;&#1085;&#1080; &#1091;&#1079;&#1083;&#1072; &#1080;&#1083;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1087;&#1091;&#1085;&#1082;&#1090; <span style="font-weight: bold;">Rename</span><br><span style="font-weight: bold;"></span></font><span style="font-family: Arial;"> &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1084;&#1099;&#1096;&#1080; &#1084;&#1077;&#1085;&#1102;.</span>
<h4 style="font-family: Arial;"><a name="ManipulateGroupsAndFolders"></a>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1091;&#1087;&#1087; &#1080; &#1087;&#1072;&#1087;&#1086;&#1082;</h4><font style="font-family: Arial;">&#1051;&#1102;&#1073;&#1086;&#1081; &#1091;&#1079;&#1077;&#1083; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1083;&#1102;&#1073;&#1086;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;:<br></font><ul style="font-family: Arial;"><li>&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; Drag-and-Drop &#1084;&#1099;&#1096;&#1100;&#1102;</li><li>&#1083;&#1080;&#1073;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1087;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1077; Ctl</li><li>&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; <span style="font-weight: bold;">Node Up</span> &#1080; <span style="font-weight: bold;">Node Down</span> &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1092;&#1086;&#1082;&#1091;&#1089; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;).</li></ul><font style="font-family: Arial;">&#1055;&#1088;&#1080;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;
&#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1103; &#1080; &#1079;&#1072;&#1093;&#1086;&#1076;&#1103; &#1074; &#1089;&#1072;&#1084;&#1099;&#1077; &#1085;&#1080;&#1079;&#1082;&#1086;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1077; &#1091;&#1079;&#1083;&#1099;.<br>&#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; Drag-and-Drop &#1084;&#1099;&#1096;&#1100;&#1102; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&nbsp;&#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1084;&#1077;&#1085;&#1102;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1102;&#1097;&#1077;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083;:<br></font><ul style="font-family: Arial;"><li>&#1074;&#1099;&#1096;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1079;&#1083;&#1072;;</li><li>&#1085;&#1080;&#1078;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1079;&#1083;&#1072;;</li><li>&#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074; &#1089;&#1072;&#1084;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; (&#1077;&#1089;&#1083;&#1080; &#1091;&#1079;&#1077;&#1083; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1086;&#1076;&#1091;&#1079;&#1083;&#1099;);</li><li>&#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099; &#1074; &#1089;&#1072;&#1084;&#1099;&#1081; &#1085;&#1080;&#1079; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; (&#1077;&#1089;&#1083;&#1080; &#1091;&#1079;&#1077;&#1083; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1086;&#1076;&#1091;&#1079;&#1083;&#1099;);</li><li>&#1074;&#1085;&#1091;&#1090;&#1088;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1079;&#1077;&#1083; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1087;&#1086;&#1076;&#1091;&#1079;&#1083;&#1099; </li></ul><font style="font-family: Arial;">&#1053;&#1080; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072; &#1085;&#1080; &#1087;&#1072;&#1087;&#1082;&#1072; &#1087;&#1088;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1093; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091;.<br></font><h4 style="font-family: Arial;"><a name="MoveFile"></a>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h4><font style="font-family: Arial;">&#1051;&#1102;&#1073;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1081; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074;&#1099;&#1096;&#1077; &#1080;&#1083;&#1080; &#1085;&#1080;&#1078;&#1077; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.<br>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086;:<br></font><ul style="font-family: Arial;"><li>&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; Drag-and-Drop &#1084;&#1099;&#1096;&#1100;&#1102;</li><li>&#1083;&#1080;&#1073;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1087;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1077; Ctl</li><li>&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;&#1084;&#1080; <span style="font-weight: bold;">File Up</span> &#1080; <span style="font-weight: bold;">File Down</span> &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; (&#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1092;&#1086;&#1082;&#1091;&#1089; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;).</li></ul><font style="font-family: Arial;">&#1055;&#1088;&#1080;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099; &#1080;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1076;&#1077;&#1088;&#1077;&#1074;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.<br>&#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; Drag-and-Drop &#1084;&#1099;&#1096;&#1100;&#1102; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&nbsp;&#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1084;&#1077;&#1085;&#1102;, &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1102;&#1097;&#1077;&#1077; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083;:<br></font><ul style="font-family: Arial;"><li>&#1074;&#1099;&#1096;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;;</li><li>&#1085;&#1080;&#1078;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.</li></ul><font style="font-family: Arial;">&#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072;&#1084;&#1080; (&#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;) &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;,
&#1077;&#1089;&#1083;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;. &#1044;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;
&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;.<br><img style="width: 469px; height: 160px;" alt="" src="PicturesEn/ConfirmMoveToOtherGroup.PNG"><br>&#1055;&#1088;&#1080; &#1086;&#1090;&#1082;&#1072;&#1079;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;.<br></font><h4 style="font-family: Arial;"><a name="MoveToGroup"></a>&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084;&#1080;</h4><font style="font-family: Arial;">&#1051;&#1102;&#1073;&#1086;&#1081;
&#1092;&#1072;&#1081;&#1083; (&#1082;&#1088;&#1086;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1087;&#1072;&#1087;&#1082;&#1077;) &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085; &#1074; &#1083;&#1102;&#1073;&#1091;&#1102; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; Drag-and-Drop, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1079;
&#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; (&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;) &#1074; &#1083;&#1077;&#1074;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; (&#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1076;&#1077;&#1088;&#1077;&#1074;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;).</font><br><h3><a name="LineColor"></a>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082;</h3>&#1044;&#1083;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1080; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072;.<br>&#1062;&#1074;&#1077;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1075;&#1088;&#1091;&#1087;&#1087;&#1072;&#1084; &#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1093; &#1087;&#1072;&#1087;&#1082;&#1072;&#1084;.<br>&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1072;&#1087;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1099;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080;.<br><br>&#1044;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;:<br><ul><li>&#1042;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075; <span style="font-weight: bold;">WorkSpace Settings</span> &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; <span style="font-weight: bold;">Options</span></li><li>&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091;&nbsp;<span style="font-weight: bold;">Misc</span></li></ul><img style="width: 695px; height: 528px;" alt="" src="PicturesEn/ChooseLanguage.PNG"><br><br>&#1042; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; <span style="font-weight: bold;">Font Color of FileList</span> &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;<br><ul><li>Group File - &#1076;&#1083;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1087;&#1088;&#1080;&#1085;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077;;</li><li>Folder File - &#1076;&#1083;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1077;&#1075;&#1086; &#1087;&#1072;&#1087;&#1082;&#1077;; </li><li>Excluded File - &#1076;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1072;&#1087;&#1082;&#1080;.</li></ul>Set FG Color &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;.<br>Set BG Color &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1076;&#1083;&#1103; &#1074;&#1099;&#1073;&#1086;&#1088;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072;.<br><br><br><br><h4></h4><br>&nbsp;</body></html>